const privacyTitle = "개인정보 처리방침";
const privacyContent = `개인정보 보호 정책

디지털규장각 이용을 위해 수집한 귀하의 정보를 관리하면서 「개인정보 보호법」에서 규정하고 있는 책임과 의무를 준수하고 제공자가 동의한 내용 외 다른 목적으로는 활용하지 않음을 알려드립니다.

1. 개인정보의 수집 및 이용 목적
가. 서비스 제공 및 개선

국가지식정보 제공을 위한 결과 산출 및 관련 정보 제공, 서비스 개선 방향 도출을 위한 통계 산출 등을 목적으로 개인정보를 처리합니다.
나. 홈페이지 회원 관리

회원제 서비스 제공에 따른 본인 식별 · 인증, 서비스 부정 이용 방지, 만 14세 미만인 아동의 개인정보 처리 시 법정대리인의 동의 여부 확인, 분쟁 조정을 위한 기록보존, 각종 고지ㆍ통지 등을 목적으로 개인정보를 처리합니다.
2. 수집하는 개인정보의 항목
과학기술정보통신부는 서비스 제공을 위해 필요한 최소한의 범위에서 다음과 같은 개인정보를 수집하고 있습니다:

필수: 아이디, 이메일 주소, 비밀번호, 닉네임
선택: 연령대, 직업군
3. 개인정보의 처리 및 보유기간
과학기술정보통신부는 법령에 따른 개인정보 보유·이용 기간 또는 정보 주체로부터 개인정보를 수집할 때 동의받은 개인정보 보유·이용 기간 내에서 개인정보를 처리·보유합니다. 각 목적에 대한 개인정보 처리 및 보유 기간은 다음과 같습니다:

홈페이지 탈퇴 또는 동의 후 재동의 이전 2년까지 보유합니다.
4. 동의를 거부할 권리 고지 및 동의 거부에 따른 불이익
이용자는 과학기술정보통신부에서 수집하는 개인정보에 대해 동의를 거부할 권리가 있으며, 필수 항목에 대한 동의 거부 시에는 회원가입 및 이용이 제한됩니다.

5. 개인정보 처리목적
가. 디지털규장각 회원 명부

국가지식정보 포털(디지털규장각)에 가입한 회원 정보를 처리합니다.
나. 디지털규장각 연계 기관 담당자 명부

국가지식정보 포털(디지털규장각) 연계 기관 담당자 정보를 처리합니다.
6. 개인정보 처리 및 보유기간 및 처리하는 개인 정보 항목
가. 디지털규장각 회원 명부

목적: 이용자 포털 회원가입, 로그인, 회원 정보 조회 및 탈퇴
수집 근거: 정보 주체 동의
수집 항목: (필수) 닉네임, 아이디(이메일 주소), 비밀번호(선택) 연령대, 직업군
보유기간: 회원 탈퇴 시 즉시 파기(2년 경과 시 재동의)
나. 디지털규장각 연계 기관 담당자 명부

목적: 연계 기관 포털 회원가입, 회원 정보 조회, 수정 및 탈퇴
수집 근거: 정보 주체 동의
수집 항목: (필수) 이름, 아이디(이메일주소), 비밀번호, 기관, 직위/직급, IP주소, 휴대폰 전화(선택) 사무실 전화
보유기간: 업무 담당자 변경 시까지

7. 개인정보 처리 위탁
가. 유지·관리를 위한 개인정보 처리 업무
처리부서: 인공지능융합본부 AI서비스혁신팀
수탁업체: 한국지능정보사회진흥원
위탁업무: 디지털규장각 시스템 유지관리를 위한 개인정보 처리 업무
보유 및 이용 기간: 시스템 운영 시까지

나. 시스템 운영 업무
처리부서: 규장각 혁신본부 
수탁업체: 정조준 클라우드
위탁업무: 디지털규장각 시스템 운영 업무
보유 및 이용기관: 위탁 계약 종료 시까지

8. 개인정보 열람청구를 접수 및 처리하는 부서
가. 디지털규장각 회원 명부
부서명: 규장각 혁신본부 
담당자: 안희재 유생
연락처: 010-1111-1111
주소: 안석빌딩 903호

나. 디지털규장각 연계 기관 담당자 명부
부서명: 규장각 혁신본부 
담당자: 신재우 유생
연락처: 010-2222-2222
주소: 안석빌딩 903호`;

export { privacyTitle, privacyContent };
