const termsTitle = "이용약관";
const termsContent = `
제1장 총칙
제1조(목적)
본 약관은 국가지식정보 통합 플랫폼 디지털규장각(이하 ‘플랫폼’이라 합니다)에서 제공되는 서비스의 이용과 관련하여, 이용조건 및 절차, 회원과 운영기관의 권리·의무 및 책임, 그 외 필요한 사항을 규정함을 목적으로 합니다.

제2조(용어의 정의)
본 약관에서 사용하는 용어의 정의는 다음과 같습니다:

“개인회원”이란 플랫폼에서 제공하는 소정의 회원가입 절차에 따라 이용약관에 동의하고 가입을 완료한 법인 또는 개인을 말합니다.
“기관회원”이란 플랫폼에서 제공하는 소정의 회원가입 절차에 따라 연계 협약을 맺은 기관의 소속 직원이 기관을 대리하여 이용약관에 동의하고 가입을 완료한 기관, 단체 등을 말합니다.
“회원”이란 개인회원과 기관회원 모두를 말합니다.
“이용자”란 디지털규장각 플랫폼에 회원으로 가입하고 플랫폼이 제공하는 서비스를 이용하는 자를 말합니다.
“연계 기관”이란 플랫폼을 통해 국가지식정보 연계 및 활용 촉진에 관한 법률 시행령(이하 “국가지식정보 법”) 제13조 제1항에 따라 연계 대상으로 지정되어 국가지식정보를 제공하고 있는 공공기관을 말합니다.
“전담 기관(이하 ‘운영기관’)”이란 플랫폼의 구축·관리 및 활용 촉진에 관한 업무를 수행하고 있는 기관을 말하며, 한국지능정보사회진흥원이 국가지식정보 법 제11조 제1항에 따라 전담 운영합니다.
본 약관에서 정의하지 않은 것은 관련 법령 및 서비스별 안내에서 정하는 바에 따르며, 그 외에는 일반 관례에 따릅니다.
제3조(약관의 효력과 변경)

운영기관은 회원이 이 약관의 내용을 쉽게 알 수 있도록 플랫폼에 게시하거나 기타의 방법으로 공지하고, 본 약관에 동의한 자 모두에게 그 효력이 발생합니다.
운영기관은 필요한 경우 관련 법령을 위배하지 않는 범위 내에서 본 약관을 변경할 수 있습니다.
본 약관이 변경되는 경우 전담 기관은 변경 사항을 시행 일자 7일 전까지 포털에 공지하고 회원이 가입 시 제공한 이메일 주소로 통지해야 하며, 회원에게 불리한 내용으로 변경할 경우에는 시행 일자 30일 전까지 포털 공지 및 이메일 통보합니다. 다만, 오탈자, 경미한 자구 수정이나 명백한 오류를 바로잡는 변경은 예외로 합니다.
회원이 변경된 약관에 동의하지 않는 경우 본인의 회원 등록을 취소(회원 탈퇴)할 수 있으며, 변경된 약관의 시행 후 거부의 의사표시 없이 계속 사용하는 경우에는 약관 변경에 대한 동의로 간주합니다.
제4조(약관 외 준칙)
본 약관에 규정되지 않은 사항은 국가지식정보 법, 공공데이터법, 개인정보 보호법, 저작권법, 정보통신망법 등 관련 법령과 소관 부처의 지침에 따르며, 법령 및 지침에 정하는 바가 없는 경우에는 일반 관례에 따릅니다.

제2장 이용조건 및 절차
제5조(이용 계약의 성립 및 제한)

이용 계약은 법인 및 개인 신청자(이하 ‘이용 희망자’라 합니다)가 온라인으로 플랫폼에서 제공하는 소정의 회원가입 신청 양식에서 요구하는 사항을 기록한 본 약관 및 개인정보 수집 및 이용에 대하여 동의하고 운영기관이 회원가입 신청에 대하여 승인함으로써 성립합니다.
이용 희망자가 기관 회원 가입 신청 사이트 화면 중 최초 로그인 시 “동의함” 버튼을 누르면 본 약관 및 개인정보 처리 방침을 충분히 읽고 동의한 것으로 간주합니다.
운영기관은 다음 각 호에 해당하는 이용 계약 신청에 대하여는 회원가입을 승낙하지 않을 수 있습니다:
다른 사람의 명의를 사용하여 신청하였을 때
회원가입 신청서의 내용을 허위로 기재한 경우 및 허위의 자료를 제출한 경우
플랫폼을 이용하여 법령과 본 약관이 금지하는 행위를 하는 경우
기타 기관, 단체에서 정한 제공 기관 및 활용 기관에 대한 공유 정책 및 업무 처리 기준에 위배된 경우
서비스 부정 이용행위에 대해 제재를 하기 전 이를 회피하기 위해 탈퇴한 사실이 존재하는 경우
회원가입 후 위 제3항 각 호의 사실이 밝혀진 경우, 전담 기관은 이용 계약의 해지, 해당 회원 ID를 삭제하거나 회원을 강제 탈퇴 조치하며, 필요할 경우 관계 법령에 따른 형사 처벌이나 행정 제재를 위한 법률 절차를 진행할 수 있습니다.
제6조(회원정보 사용에 대한 동의)

회원의 개인정보는 개인정보 보호법 등 관련 법령에 의해 보호됩니다.
회원 정보는 다음과 같이 이용, 관리, 보호됩니다:
개인정보의 이용: 운영기관은 회원의 개인정보를 본인의 동의 없이 이용하거나 제삼자에게 제공하지 않습니다. 단, 관련 법률의 규정에 의해 허용되는 경우에는 예외로 합니다.
개인정보의 관리: 회원은 개인정보의 보호 및 관리를 위하여 플랫폼 서비스의 개인정보관리 기능을 통해 수시로 개인정보를 수정·삭제할 수 있습니다.
개인정보의 보호: 회원의 개인정보는 전적으로 회원의 ID(혹은 닉네임)와 비밀번호에 의해 관리하고 오직 회원만이 열람 수정 및 삭제할 수 있습니다. 따라서 타인에게 회원의 ID(혹은 닉네임)와 비밀번호를 알려주어서는 안 되며, 이용 종료할 때에는 반드시 접속을 종료해야 합니다.
개인정보의 폐기: 회원 탈퇴할 때 운영기관은 플랫폼에 등록된 회원 정보를 즉시 폐기합니다.
회원이 본 약관에 동의하고 가입을 신청한 것은 회원가입 신청 시 제공한 개인정보를 운영기관이 수집, 이용함에 동의하는 것으로 간주합니다.
제7조(회원의 정보 보안)

회원이 플랫폼의 회원가입 절차를 완료하는 순간부터 회원은 ID(혹은 닉네임)와 비밀번호 등 관련 정보를 안전하게 관리할 책임이 있으며, 해당 책임을 다하지 않음으로써 발생하는 결과에 대한 모든 책임은 회원이 부담합니다.
회원은 자신의 ID(혹은 닉네임)나 비밀번호가 부정하게 사용되었다는 사실을 발견한 경우 즉시 운영기관에 신고하여야 합니다. 신고하지 않아 발생한 결과에 대한 모든 책임은 회원이 부담합니다.
회원은 플랫폼 서비스를 정상적으로 종료하지 아니하여 제삼자가 회원에 관한 정보를 이용하게 되는 등의 결과가 발생하는 경우 관련 손해 등 법적 문제에 대하여 운영기관은 책임을 지지 않습니다.
제8조(플랫폼 서비스의 이용 시간)

이용 시간은 플랫폼 서비스와 관련한 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴, 1일 24시간을 원칙으로 합니다.
운영기관은 제1항의 이용 시간에도 불구하고 정기 점검 등 플랫폼의 원활한 운영을 위해 필요하다고 판단되는 경우 플랫폼에 미리 공지 후 서비스 이용을 제한할 수 있습니다.
제9조(플랫폼 서비스의 중단)

운영기관은 국가비상사태, 정전, 설비 장애, 기타 불가항력에 의한 사유로 플랫폼 서비스의 원활한 제공이 어렵다고 판단되는 경우, 관련 법령에 근거하여 업무절차나 시스템의 개선이 필요한 경우, 기타 플랫폼 서비스의 계속적 제공이 어려운 경우 플랫폼 서비스를 일시적 또는 영구적으로 중단할 수 있으며, 영구적 중단의 경우 3개월 전 회원에게 공지하여야 합니다.
운영기관은 제1항의 서비스 중단으로 인해 회원 및 제삼자에게 발생한 손해에 대해 책임을 지지 않습니다.
운영기관은 플랫폼 서비스의 원활한 운영을 위하여 필요하다고 판단되는 경우 사전 고지 후 서비스를 일시적으로 수정, 변경 및 중단할 수 있으며, 이에 따라 회원 또는 제삼자에게 발생한 손해에 대해 책임을 지지 않습니다.
제10조(게시물의 관리)
운영기관은 플랫폼의 원활한 운영을 위하여 회원이 게시한 글, 사진, 동영상 및 각종 파일, 링크 등 모든 정보(이하 ‘게시물’이라 합니다)를 사전 통지 없이 삭제할 수 있습니다.

본 서비스 약관에 위배되거나 상용 또는 불법, 음란, 저속하다고 판단되는 게시물을 게시한 경우
다른 회원 또는 제삼자를 비방하거나 중상모략으로 명예를 훼손하는 내용인 경우
공공 질서 및 미풍양속에 위반되는 내용인 경우
범죄적 행위에 결부된다고 인정되는 내용일 경우
제삼자의 저작권 등 기타 권리를 침해하는 내용인 경우
기타 관계 법령에 위배되는 경우
제11조(서비스의 이용 제한)

회원이 제공하는 정보의 내용이 허위인 것으로 판명되거나, 그러하다고 의심할 만한 합리적인 사유가 발생할 경우 운영기관은 회원의 서비스 이용을 일부 또는 전부 중지할 수 있으며, 이에 따라 발생하는 불이익에 대해 책임을 부담하지 아니합니다.
운영기관은 회원이 본 약관을 위배했다고 판단될 경우 서비스의 이용을 제한할 수 있으며, 해당 이용 제한으로 인해 발생한 손해에 대해 책임을 지지 않습니다.
제3장 권리·의무 및 책임
제12조(회원)

회원이 플랫폼 서비스를 이용하면서 작성한 게시물에 대한 저작권 등 법령상 보호되는 권리는 회원에게 귀속됩니다.
회원은 게시물 작성 시 타인의 저작권 등 관련 법령에 위반되는 정보가 포함되지 않도록 주의하여야 하며, 이와 관련하여 발생하는 민, 형사상의 책임은 회원이 부담하여야 합니다.
회원 가입할 때에 요구되는 정보는 정확하게 기재하여야 합니다. 또한 이미 제공된 귀하에 대한 정보가 정확한 정보가 되도록 유지, 갱신하여야 합니다.
회원은 플랫폼 서비스 이용과 관련하여 다음 각 호의 행위를 하여서는 안 됩니다:
자신의 ID(혹은 닉네임) 및 비밀번호를 제삼자에게 이용하게 하거나 다른 회원의 ID(혹은 닉네임)를 부정 사용하는 행위
범죄행위를 목적으로 하거나 기타 범죄 행위와 관련된 행위
선량한 풍속, 기타 사회질서를 해하는 행위
타인의 명예를 훼손하거나 모욕하는 행위
타인의 지식재산권 등의 권리를 침해하는 행위
해킹 또는 컴퓨터 바이러스의 유포행위
광고성 정보 등 포털 서비스와 무관한 정보를 지속해서 게시하는 행위
기타 서비스의 안정적인 운영에 지장을 주거나 줄 우려가 있는 모든 행위
제13조(전담 기관)

전담 기관(이하 “운영기관”)은 국가지식정보 연계 및 활용 촉진에 관한 법률 시행령(이하 “국가지식정보 법”) 등 근거 법령에 따라 적법하게 관련 업무를 수행하여야 하며, 지속적, 안정적으로 서비스를 제공하기 위해 노력할 의무가 있습니다.
전담 기관(이하 “운영기관”)은 회원의 개인정보를 본인의 동의 없이 이용하거나 타인에게 제공하지 않습니다. 다만, 개인정보 보호법 등 관련 법령에 의하여 허용되는 경우에는 예외로 합니다.
전담 기관(이하 “운영기관”)은 회원이 안전하게 서비스를 이용하도록 회원의 개인정보(신용정보 포함)를 보호해야 합니다.
전담 기관(이하 “운영기관”)은 회원의 귀책 사유로 인한 서비스 이용 장애에 대하여 책임을 지지 않습니다.
제14조(연계 기관)

연계 기관은 보유·관리하는 국가지식정보가 국가지식정보 법 제11조 및 제13조에 따른 연계 대상에 해당하는 경우, 관련 절차에 따라 제공 목록을 등록하고 해당 국가지식정보를 플랫폼에 등록하여야 합니다.
연계 기관은 이용자가 제공 목록에 등록되지 않은 국가지식정보를 국가지식정보 법에 따라 제공 신청할 경우 법률에 규정된 절차 및 기준을 준수하여 제공 여부를 결정해야 하며, 제공 여부를 결정한 때에는 지체 없이 결정 내용을 알려야 합니다.
연계 기관은 플랫폼에서 제공하는 국가지식정보를 현행화하여 제공하고, 이용자가 신고한 국가지식정보 등록 누락, 이용 불편 사항 등에 대해서 조치해야 합니다.
연계 기관은 다음의 기준에 해당할 경우 국가지식정보의 제공을 중단할 수 있습니다:
이용자가 공표된 이용요건을 위반하여 공공기관 본래의 업무수행에 상당한 지장을 초래할 우려가 있는 경우
국가지식정보의 이용이 제삼자의 권리를 현저하게 침해하는 경우
국가지식정보를 범죄 등의 불법행위에 악용하는 경우
국가지식정보를 생성·관리하는 업무가 폐지되는 등에 따른 사유로 연계 기관이 과학기술정보통신부 장관에게 국가지식정보 제공 목록의 제외를 요청한 경우
오픈 API 방식으로 제공되는 국가지식정보의 이용과 관련하여, 연계 기관은 특정 회원의 이용 형태로 인해 연계 기관의 업무에 지장을 초래하거나 제공시스템의 성능 저하 등의 문제가 발생할 경우 서비스 이용을 제한할 수 있습니다.
제4장 기타
제15조(플랫폼 서비스에 대한 지식재산권)

서비스에 대한 지식재산권은 원칙적으로 운영기관에 귀속됩니다. 다만 계약 등 달리 정함이 있는 경우 그러하지 않습니다.
자료실 메뉴에 게시된 정보는 국가지식정보 제공 결정을 통한 것이 아니며, 공공기관 및 제삼자의 지식재산이 포함될 수 있습니다. 따라서 이용 시 관련 권리가 침해되지 않도록 유의하여야 합니다.
회원은 운영기관의 승인 없이 플랫폼 서비스에 대한 지식재산을 이용하거나 제삼자가 이용하게 해서는 안 됩니다.
제16조(책임 제한)

연계 기관은 국가지식정보의 제공과 관련하여 국가지식정보의 품질, 공공데이터의 제공 중단 등 이용자 또는 제삼자에게 손해가 발생한 경우 그에 대한 책임을 지지 않습니다.
운영기관은 회원의 플랫폼 서비스 이용과 관련하여 회원 또는 제삼자에게 손해가 발생하더라도 책임을 지지 않습니다. 다만 해당 손해가 운영기관의 범죄행위 등으로 인해 발생한 경우에는 예외로 합니다.
제17조(관할법원)

플랫폼 서비스의 이용과 관련하여 분쟁이 발생할 경우 민사소송법에 따른 관할법원에 소송을 제기할 수 있습니다.
부칙
본 약관은 2022년 12월 31일부터 시행됩니다.`;

export { termsTitle, termsContent };
